apitest/JMeter/petstore-comprehensive.jmx

<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
	<hashTree>
		<TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Petstore Comprehensive Load Test">
			<elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
				<collectionProp name="Arguments.arguments">
					<elementProp name="BASE_URL" elementType="Argument">
						<stringProp name="Argument.name">BASE_URL</stringProp>
						<stringProp name="Argument.value">petstore.swagger.io</stringProp>
					</elementProp>
					<elementProp name="TIMEOUT" elementType="Argument">
						<stringProp name="Argument.name">TIMEOUT</stringProp>
						<stringProp name="Argument.value">10000</stringProp>
					</elementProp>
				</collectionProp>
			</elementProp>
			<boolProp name="TestPlan.functional_mode">false</boolProp>
		</TestPlan>
		<hashTree>
			<ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
				<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
					<collectionProp name="Arguments.arguments"/>
				</elementProp>
				<stringProp name="HTTPSampler.domain">petstore.swagger.io</stringProp>
				<stringProp name="HTTPSampler.protocol">https</stringProp>
				<stringProp name="HTTPSampler.concurrentPool">4</stringProp>
				<stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
				<stringProp name="HTTPSampler.response_timeout">10000</stringProp>
			</ConfigTestElement>
			<hashTree/>
		</hashTree>


			<!-- SMOKE TEST -->
			<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="1.Smoke Test (Baseline)">
				<intProp name="ThreadGroup.num_threads">1</intProp>
				<intProp name="ThreadGroup.ramp_time">1</intProp>
				<elementProp name="ThreadGroup.main_controller" elementType="LoopController">
					<boolProp name="LoopController.continue_forever">false</boolProp>
					<intProp name="LoopController.loops">5</intProp>
				</elementProp>
			</ThreadGroup>
			<hashTree>
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Smoke] GET Pets Available">
					<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
					<stringProp name="HTTPSampler.protocol">https</stringProp>
					<stringProp name="HTTPSampler.path">/v2/pet/findByStatus? status=available</stringProp>
					<stringProp name="HTTPSampler.method">GET</stringProp>
				</HTTPSamplerProxy>
				<hashTree>
					<ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 200 OK">
						<collectionProp name="Asserion.test_strings">
							<stringProp name="49586">200</stringProp>
						</collectionProp>
						<intProp name="Assertion.test_type">16</intProp>
						<stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
					</ResponseAssertion>
					<hashTree/>
				</hashTree>
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Smoke] GET Store Inventory">
					<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
					<stringProp name="HTTPSampler.protocol">https</stringProp>
					<stringProp name="HTTPSampler.path">/v2/store/inventory</stringProp>
					<stringProp name="HTTPSampler.method">GET</stringProp>
				</HTTPSamplerProxy>
				<hashTree/>
				<ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time">
					<stringProp name="ConstantTimer.delay">500</stringProp>
				</ConstantTimer>
				<hashTree/>
			</hashTree>



		<!-- STRESS TEST -->
		<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="2.Stress Test (Ramp Up)">
			<intProp name="ThreadGroup.num_threads">50</intProp>
			<intProp name="ThreadGroup.ramp_time">30</intProp>
			<elementProp name="ThreadGroup.main_controller" elementType="LoopController">
				<boolProp name="LoopController.continue_forever">false</boolProp>
				<intProp name="LoopController.loops">3</intProp>
			</elementProp>
		</ThreadGroup>
		<hashTree>
			<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Stress] GET Pets Available">
				<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
				<stringProp name="HTTPSampler.protocol">https</stringProp>
				<stringProp name="HTTPSampler.path">/v2/pet/findByStatus?status=available</stringProp>
				<stringProp name="HTTPSampler.method">GET</stringProp>
			</HTTPSamplerProxy>
			<hashTree/>
			<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Stress] GET Pets Pending">
				<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
				<stringProp name="HTTPSampler.protocol">https</stringProp>
				<stringProp name="HTTPSampler.path">/v2/pet/findByStatus?status=pending</stringProp>
				<stringProp name="HTTPSampler.method">GET</stringProp>
			</HTTPSamplerProxy>
			<hashTree/>
			<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Stress] GET Pets Sold">
				<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
				<stringProp name="HTTPSampler.protocol">https</stringProp>
				<stringProp name="HTTPSampler.path">/v2/pet/findByStatus?status=sold</stringProp>
				<stringProp name="HTTPSampler.method">GET</stringProp>
			</HTTPSamplerProxy>
			<hashTree/>
			<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Stress] GET Store Inventory">
				<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
				<stringProp name="HTTPSampler.protocol">https</stringProp>
				<stringProp name="HTTPSampler.path">/v2/store/inventory</stringProp>
				<stringProp name="HTTPSampler.method">GET</stringProp>
			</HTTPSamplerProxy>
			<hashTree/>
			<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Stress] POST Create Pet">
				<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
				<stringProp name="HTTPSampler.protocol">https</stringProp>
				<stringProp name="HTTPSampler.path">/v2/pet</stringProp>
				<stringProp name="HTTPSampler.method">POST</stringProp>
				<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
				<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
					<collectionProp name="Arguments.arguments">
						<elementProp name="" elementType="HTTPArgument">
							<stringProp name="Argument.value">{"id": ${__Random(10000,99999)},"name":"LoadTestPet_${__threadNum}","category": {"id":1,"name":"Dogs"},"photoUrls":["http://example.com/photo.jpg"],"tags":[{"id":1,"name":"load-test"}],"status":"available"}</stringProp>
						</elementProp>
					</collectionProp>
				</elementProp>
			</HTTPSamplerProxy>
			<hashTree>
				<HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON Headers">
					<collectionProp name="HeaderManager.headers">
						<elementProp name="" elementType="Header">
							<stringProp name="Header.name">Content-Type</stringProp>
							<stringProp name="Header.value">application/json</stringProp>
						</elementProp>
						<elementProp name="" elementType="Header">
							<stringProp name="Header.name">Accept</stringProp>
							<stringProp name="Header.value">application/json</stringProp>
						</elementProp>
					</collectionProp>
				</HeaderManager>
				<hashTree/>
			</hashTree>
			<UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Random Think Time">
				<stringProp name="ConstantTimer.delay">300</stringProp>
				<stringProp name="RandomTimer.range">700</stringProp>
			</UniformRandomTimer>
			<hashTree/>
		</hashTree>



		<!-- SPIKE TEST -->
		<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="3.Spike Test (Sudden Load)">
			<intProp name="ThreadGroup.num_threads">75</intProp>
			<intProp name="ThreadGroup.ramp_time">10</intProp>
			<elementProp name="ThreadGroup.main_controller" elementType="LoopController">
				<boolProp name="LoopController.continue_forever">false</boolProp>
				<intProp name="LoopController.loops">2</intProp>
			</elementProp>
			<boolProp name="ThreadGroup.delayedStart">true</boolProp>
		</ThreadGroup>
		<hashTree>
			<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Spike] GET Pets Available">
				<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
				<stringProp name="HTTPSampler.protocol">https</stringProp>
				<stringProp name="HTTPSampler.path">/v2/pet/findByStatus? status=available</stringProp>
				<stringProp name="HTTPSampler.method">GET</stringProp>
			</HTTPSamplerProxy>
			<hashTree/>
			<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Spike] GET Store Inventory">
				<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
				<stringProp name="HTTPSampler.protocol">https</stringProp>
				<stringProp name="HTTPSampler.path">/v2/store/inventory</stringProp>
				<stringProp name="HTTPSampler.method">GET</stringProp>
			</HTTPSamplerProxy>
			<hashTree/>
		</hashTree>

		<!-- ENDURANCE TEST -->
		<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="4.Endurance Test (Sustained Load)">
			<intProp name="ThreadGroup.num_threads">15</intProp>
			<intProp name="ThreadGroup.ramp_time">10</intProp>
			<elementProp name="ThreadGroup.main_controller" elementType="LoopController">
				<boolProp name="LoopController.continue_forever">false</boolProp>
				<intProp name="LoopController.loops">10</intProp>
			</elementProp>
		</ThreadGroup>
		<hashTree>
			<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Endurance] GET Pets">
				<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
				<stringProp name="HTTPSampler.protocol">https</stringProp>
				<stringProp name="HTTPSampler.path">/v2/pet/findByStatus? status=available</stringProp>
				<stringProp name="HTTPSampler.method">GET</stringProp>
			</HTTPSamplerProxy>
			<hashTree/>
			<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Endurance] GET Inventory">
				<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
				<stringProp name="HTTPSampler.protocol">https</stringProp>
				<stringProp name="HTTPSampler.path">/v2/store/inventory</stringProp>
				<stringProp name="HTTPSampler.method">GET</stringProp>
			</HTTPSamplerProxy>
			<hashTree/>
			<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Endurance] POST Order">
				<stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
				<stringProp name="HTTPSampler.protocol">https</stringProp>
				<stringProp name="HTTPSampler.path">/v2/store/order</stringProp>
				<stringProp name="HTTPSampler.method">POST</stringProp>
				<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
				<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
					<collectionProp name="Arguments.arguments">
						<elementProp name="" elementType="HTTPArgument">
							<stringProp name="Argument.value">{"id":${__Random(1000,9999)},"petId": ${__Random(1,100)},"quantity":1,"shipDate":"2026-01-04T12:00:00.000Z","status":"placed","complete":true}</stringProp>
						</elementProp>
					</collectionProp>
				</elementProp>
			</HTTPSamplerProxy>
			<hashTree>
				<HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON Headers">
					<collectionProp name="HeaderManager.headers">
						<elementProp name="" elementType="Header">
							<stringProp name="Header.name">Content-Type</stringProp>
							<stringProp name="Header.value">application/json</stringProp>
						</elementProp>
					</collectionProp>
				</HeaderManager>
				<hashTree/>
			</hashTree>
			<ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time">
				<stringProp name="ConstantTimer.delay">200</stringProp>
			</ConstantTimer>
			<hashTree/>
		</hashTree>
	</hashTree>
</jmeterTestPlan>