apitest/JMeter/results/jmeter-report/statistics.json
{
  "[Stress] POST Create Pet" : {
    "transaction" : "[Stress] POST Create Pet",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 413.62666666666644,
    "medianResTime" : 403.0,
    "minResTime" : 378.0,
    "maxResTime" : 845.0,
    "pct1ResTime" : 443.9,
    "pct2ResTime" : 520.05,
    "pct3ResTime" : 687.9200000000028,
    "throughput" : 3.4629236309908578,
    "receivedKBytesPerSec" : 1.707180768942192,
    "sentKBytesPerSec" : 1.2776970764267244
  },
  "[Stress] GET Pets Sold" : {
    "transaction" : "[Stress] GET Pets Sold",
    "sampleCount" : 150,
    "errorCount" : 1,
    "errorPct" : 0.6666667,
    "meanResTime" : 415.02000000000004,
    "medianResTime" : 401.0,
    "minResTime" : 380.0,
    "maxResTime" : 957.0,
    "pct1ResTime" : 432.8,
    "pct2ResTime" : 489.5999999999997,
    "pct3ResTime" : 954.96,
    "throughput" : 3.4808437565265824,
    "receivedKBytesPerSec" : 8.112042921704221,
    "sentKBytesPerSec" : 0.5030906991854825
  },
  "[Stress] GET Pets Available" : {
    "transaction" : "[Stress] GET Pets Available",
    "sampleCount" : 150,
    "errorCount" : 3,
    "errorPct" : 2.0,
    "meanResTime" : 1238.9799999999993,
    "medianResTime" : 1438.0,
    "minResTime" : 417.0,
    "maxResTime" : 2049.0,
    "pct1ResTime" : 1599.3,
    "pct2ResTime" : 1624.25,
    "pct3ResTime" : 2027.0700000000004,
    "throughput" : 3.4317875037177696,
    "receivedKBytesPerSec" : 479.2339767696584,
    "sentKBytesPerSec" : 0.5127573125672058
  },
  "[Endurance] POST Order" : {
    "transaction" : "[Endurance] POST Order",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 410.1866666666667,
    "medianResTime" : 399.0,
    "minResTime" : 379.0,
    "maxResTime" : 796.0,
    "pct1ResTime" : 435.9,
    "pct2ResTime" : 449.9,
    "pct3ResTime" : 711.3400000000015,
    "throughput" : 5.636554937622125,
    "receivedKBytesPerSec" : 2.4379934921276116,
    "sentKBytesPerSec" : 1.6123262649368706
  },
  "[Smoke] GET Store Inventory" : {
    "transaction" : "[Smoke] GET Store Inventory",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 401.0,
    "medianResTime" : 396.0,
    "minResTime" : 393.0,
    "maxResTime" : 422.0,
    "pct1ResTime" : 422.0,
    "pct2ResTime" : 422.0,
    "pct3ResTime" : 422.0,
    "throughput" : 0.6578081831337982,
    "receivedKBytesPerSec" : 0.26582131462965397,
    "sentKBytesPerSec" : 0.08672275851861597
  },
  "[Smoke] GET Pets Available" : {
    "transaction" : "[Smoke] GET Pets Available",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 425.6,
    "medianResTime" : 398.0,
    "minResTime" : 386.0,
    "maxResTime" : 536.0,
    "pct1ResTime" : 536.0,
    "pct2ResTime" : 536.0,
    "pct3ResTime" : 536.0,
    "throughput" : 0.6455777921239509,
    "receivedKBytesPerSec" : 0.20993887185280827,
    "sentKBytesPerSec" : 0.09834974176888316
  },
  "[Stress] GET Pets Pending" : {
    "transaction" : "[Stress] GET Pets Pending",
    "sampleCount" : 150,
    "errorCount" : 2,
    "errorPct" : 1.3333334,
    "meanResTime" : 413.8599999999999,
    "medianResTime" : 400.0,
    "minResTime" : 381.0,
    "maxResTime" : 736.0,
    "pct1ResTime" : 447.5000000000001,
    "pct2ResTime" : 537.45,
    "pct3ResTime" : 641.6500000000017,
    "throughput" : 3.478018920422927,
    "receivedKBytesPerSec" : 8.856381186526155,
    "sentKBytesPerSec" : 0.5128719306483027
  },
  "[Endurance] GET Pets" : {
    "transaction" : "[Endurance] GET Pets",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 430.1333333333334,
    "medianResTime" : 400.5,
    "minResTime" : 376.0,
    "maxResTime" : 798.0,
    "pct1ResTime" : 536.5,
    "pct2ResTime" : 602.0,
    "pct3ResTime" : 795.45,
    "throughput" : 5.586176076269925,
    "receivedKBytesPerSec" : 1.8165982748026217,
    "sentKBytesPerSec" : 0.8510190116192462
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1510,
    "errorCount" : 9,
    "errorPct" : 0.5960265,
    "meanResTime" : 503.30331125827814,
    "medianResTime" : 404.0,
    "minResTime" : 376.0,
    "maxResTime" : 2049.0,
    "pct1ResTime" : 784.8000000000002,
    "pct2ResTime" : 1437.9,
    "pct3ResTime" : 1599.2300000000007,
    "throughput" : 31.207374033811433,
    "receivedKBytesPerSec" : 456.7496804667156,
    "sentKBytesPerSec" : 5.598997353315008
  },
  "[Endurance] GET Inventory" : {
    "transaction" : "[Endurance] GET Inventory",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 425.2599999999999,
    "medianResTime" : 399.0,
    "minResTime" : 381.0,
    "maxResTime" : 966.0,
    "pct1ResTime" : 449.0,
    "pct2ResTime" : 512.3499999999999,
    "pct3ResTime" : 963.45,
    "throughput" : 5.629785317519892,
    "receivedKBytesPerSec" : 2.2759213495533706,
    "sentKBytesPerSec" : 0.7422080252589701
  },
  "[Stress] GET Store Inventory" : {
    "transaction" : "[Stress] GET Store Inventory",
    "sampleCount" : 150,
    "errorCount" : 2,
    "errorPct" : 1.3333334,
    "meanResTime" : 405.2800000000001,
    "medianResTime" : 396.5,
    "minResTime" : 378.0,
    "maxResTime" : 527.0,
    "pct1ResTime" : 428.8,
    "pct2ResTime" : 453.45,
    "pct3ResTime" : 525.98,
    "throughput" : 3.4675666928660593,
    "receivedKBytesPerSec" : 1.4013619951800822,
    "sentKBytesPerSec" : 0.4571499057977715
  },
  "[Spike] GET Pets Available" : {
    "transaction" : "[Spike] GET Pets Available",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 478.4933333333334,
    "medianResTime" : 496.0,
    "minResTime" : 379.0,
    "maxResTime" : 748.0,
    "pct1ResTime" : 565.8,
    "pct2ResTime" : 578.3499999999999,
    "pct3ResTime" : 706.6900000000007,
    "throughput" : 13.294336612603031,
    "receivedKBytesPerSec" : 4.323255949215635,
    "sentKBytesPerSec" : 2.025309093326243
  },
  "[Spike] GET Store Inventory" : {
    "transaction" : "[Spike] GET Store Inventory",
    "sampleCount" : 150,
    "errorCount" : 1,
    "errorPct" : 0.6666667,
    "meanResTime" : 408.19333333333327,
    "medianResTime" : 399.0,
    "minResTime" : 386.0,
    "maxResTime" : 504.0,
    "pct1ResTime" : 436.9,
    "pct2ResTime" : 452.24999999999994,
    "pct3ResTime" : 504.0,
    "throughput" : 13.591881116346501,
    "receivedKBytesPerSec" : 5.493739239760783,
    "sentKBytesPerSec" : 1.7918983893620877
  }
}